# Combine Datasets and Export

In [98]:
# import libraries

import pandas as pd
import numpy as np
import os

## Import Files

### Import Orders Products Combined Pickle File

In [99]:
# import the orders_products_combined.pkl file

path = r'/Users/patel/Documents/CF-Data Anaylst Course/Achievement-4/Instacart Basket Analysis-Oct 2023/02 Data/'
df_ords_merged = pd.read_pickle(os.path.join(path, 'Prepared Data/orders_products_combined.pkl'))
df_ords_merged.head()

,order_id,user_id,number_of_orders,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

### Check shape of dataframe

In [100]:
df_ords_merged.shape

(32434489, 10)

In [101]:
df_ords_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   number_of_orders        int8
 3   orders_days_of_week     int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float32
 6   product_id              object
 7   add_to_cart_order       int32
 8   reordered               int8
 9   _merge                  category
dtypes: category(1), float32(1), int32(1), int8(4), object(3)
memory usage: 1.1+ GB

In [102]:
# drop the _merge column as its no longer required
df_ords_merged.drop(columns=['_merge'], inplace=True)

# check if the drop columb action was successful
df_ords_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 9 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   number_of_orders        int8
 3   orders_days_of_week     int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float32
 6   product_id              object
 7   add_to_cart_order       int32
 8   reordered               int8
dtypes: float32(1), int32(1), int8(4), object(3)
memory usage: 1.1+ GB

### Merge Products and Orders Product datasets

#### 1. Import products file

In [103]:
dtypes = {'aisle_id': 'int16', 'department_id': 'int8'}
df_prods = pd.read_csv(os.path.join(path, 'Prepared Data/products_checked.csv'), dtype=dtypes, index_col=0)

df_prods['product_id'] = df_prods['product_id'].astype('str') 
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [104]:
df_prods.shape

(49672, 5)

In [105]:
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
Index: 49672 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  object
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int16
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float64
dtypes: float64(1), int16(1), int8(1), object(2)
memory usage: 1.7+ MB

In [106]:
df_prods_dups = df_prods[df_prods.duplicated(subset=['product_id'], keep = False)]
df_prods_dups.head(20)

,product_id,product_name,aisle_id,department_id,prices
6799,6800,Revive Zero Vitamin Water,64,7,6.4
6800,6800,Sprouted Quinoa Flakes Baby Cereal,92,18,14.0
26520,26520,Clinical Advanced Solid Ultimate Fresh Anti-Pe...,80,11,10.6
26521,26520,Cheese Shredded Sharp Cheddar Reduced Fat 2%,21,16,2.9

#### 2. Merge orders_products with products using left join

In [107]:
# used left join to combine both datasets
df_ords_prods_combined = df_ords_merged.merge(df_prods, on=['product_id'], how='left', indicator=True)
df_ords_prods_combined.head()

,order_id,user_id,number_of_orders,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77.0,7.0,9.0,both
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91.0,16.0,12.5,both
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,23.0,19.0,4.4,both
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,23.0,19.0,4.7,both
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54.0,17.0,1.0,both

In [108]:
df_ords_prods_combined.shape

(32435059, 14)

#### ---------

#### Investigating difference in row count between orders_product and merge database. Expected left merged dataset to have 32434489 rows. Instead extra 570 rows was in the combined set

In [109]:
# checking difference in rows
32435059 - 32434489

570

In [110]:
# checking for duplicated rows with combination of order_id and product_id
df_dups = df_ords_prods_combined[df_ords_prods_combined.duplicated(subset=['order_id', 'product_id'], keep='first')]
df_dups.shape

(570, 14)

In [111]:
# found 2 product ids that are resulting in additional 570 rows
df_dups['product_id'].unique()

array(['26520', '6800'], dtype=object)

In [112]:
# same product id shows 2 different products
df_prods_dups = df_prods[df_prods.duplicated(subset=['product_id'], keep = False)]
df_prods_dups.head(20)

,product_id,product_name,aisle_id,department_id,prices
6799,6800,Revive Zero Vitamin Water,64,7,6.4
6800,6800,Sprouted Quinoa Flakes Baby Cereal,92,18,14.0
26520,26520,Clinical Advanced Solid Ultimate Fresh Anti-Pe...,80,11,10.6
26521,26520,Cheese Shredded Sharp Cheddar Reduced Fat 2%,21,16,2.9

using left join, extra 570 rows appear in the combined set is because duplicate product_ids exists in product table. They are not unique.

### ----------

#### Confirmed list merge using merge flag

In [113]:
# checking the rows count of merge flag
df_ords_prods_combined.value_counts('_merge')

_merge
both          32404859
left_only        30200
right_only           0
Name: count, dtype: int64

In [114]:
# checking on number of null values since we have left_only with 30,200 rows
df_ords_prods_combined.isnull().sum()

order_id                        0
user_id                         0
number_of_orders                0
orders_days_of_week             0
order_hour_of_day               0
days_since_prior_order    2078102
product_id                      0
add_to_cart_order               0
reordered                       0
product_name                30200
aisle_id                    30200
department_id               30200
prices                      30200
_merge                          0
dtype: int64

In [115]:
# extract list of product_ids in orders_products_combined but doesn't exists in product table
null_product_name = df_ords_prods_combined[df_ords_prods_combined['product_name'].isnull()]
null_product_name_prod_id = null_product_name['product_id'].unique()
null_product_name_prod_id.shape

(18,)

In [116]:
df_prods[(df_prods['product_id'].isin(null_product_name_prod_id) == True)]

Empty DataFrame
Columns: [product_id, product_name, aisle_id, department_id, prices]
Index: []

#### found 18 products that is not in products table. Ideally further investigation required for missing product_ids

#### Merge orders_products with products using inner join

Using inner join since 18 products are missing from product table that exists in orders_products_combined

In [117]:
# used inner join to merge prods and orders_products
df_ords_prods_combined_v2 = df_ords_merged.merge(df_prods, on=['product_id'], indicator=True)
df_ords_prods_combined_v2.head()

,order_id,user_id,number_of_orders,orders_days_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [118]:
df_ords_prods_combined_v2.shape

(32404859, 14)

#### Check merge flags

In [119]:
df_ords_prods_combined_v2.value_counts('_merge')

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

### Export merged dataset

In [120]:
# exporting the dataset as pickle file

df_ords_prods_combined_v2.to_pickle(os.path.join(path, 'Prepared Data/orders_products_merged.pkl'))